## Importaciones

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
df1 = pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/sales_train_evaluation.csv')
df2= pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/sell_prices.csv')
df3= pd.read_csv('/Users/yairmartinez/Documents/GitHub/Data_visualization/Extract/calendar.csv')

### Transformar en SQLite

In [4]:
### Transformar a SQL ####

# Conectar de SQLite
con = sql.connect('db.db') #Conector
cur = con.cursor() #Cursor

# Transformar de csv's a SQL
df1.to_sql('df1', con, if_exists='replace', index=False)
df2.to_sql('df2', con, if_exists='replace', index=False)
df3.to_sql('df3', con, if_exists='replace', index=False)

1969

In [15]:
# CODIGO EN SQL

sql_1 = "SELECT item_id, store_id FROM df1 LIMIT 10"
sql_2 = "SELECT columnas FROM df1 LIMIT 10"
sql_3 = "SELECT df1.* FROM df1 JOIN df2 ON df1.store_id = df2.store_id  LIMIT 10"

In [16]:
# Ejecución
cur.execute(sql_3).fetchall()

# NUEVA TABLA
dfm = pd.read_sql(sql_3, con)
dfm.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
2,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
3,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
4,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1